In [12]:
import pandas as pd
import numpy as np

from datetime import datetime

In [13]:
myyear=2015
mymonth=1
myday=2
myhour=2
mymin=30
mysec=40

In [14]:
mydate=datetime(myyear,mymonth,myday)

In [15]:
mydate

datetime.datetime(2015, 1, 2, 0, 0)

In [16]:
mydatetime=datetime(myyear,mymonth,myday,myhour,mymin,mysec)

In [17]:
mydatetime

datetime.datetime(2015, 1, 2, 2, 30, 40)

In [19]:
mydatetime.year

2015

In [20]:
myser=pd.Series(['Nov 3, 1990','2000-01-01',None])

In [22]:
myser

0    Nov 3, 1990
1     2000-01-01
2           None
dtype: object

In [26]:
pd.to_datetime(myser)

0   1990-11-03
1   2000-01-01
2          NaT
dtype: datetime64[ns]

In [27]:
obvi_euro_date='31-12-2020'

In [28]:
pd.to_datetime(obvi_euro_date)

C:\Users\prath\AppData\Local\Temp\ipykernel_9052\163700324.py:1: UserWarning: Parsing '31-12-2020' in DD/MM/YYYY format. Provide format or specify infer_datetime_format=True for consistent parsing.
  pd.to_datetime(obvi_euro_date)

Timestamp('2020-12-31 00:00:00')

In [31]:
euro_date='2-3-2020'

In [33]:
pd.to_datetime(euro_date,dayfirst=True)

Timestamp('2020-03-02 00:00:00')

In [34]:
style_date='12--Dec--2000'

In [36]:
pd.to_datetime(style_date,format="%d--%b--%Y")

Timestamp('2000-12-12 00:00:00')

In [38]:
sales=pd.read_csv('./RetailSales_BeerWineLiquor.csv')
sales

           DATE  MRTSSM4453USN
0    1992-01-01           1509
1    1992-02-01           1541
2    1992-03-01           1597
3    1992-04-01           1675
4    1992-05-01           1822
..          ...            ...
335  2019-12-01           6630
336  2020-01-01           4388
337  2020-02-01           4533
338  2020-03-01           5562
339  2020-04-01           5207

[340 rows x 2 columns]

In [40]:
sales['DATE']=pd.to_datetime(sales['DATE'])

In [41]:
sales.head()

        DATE  MRTSSM4453USN
0 1992-01-01           1509
1 1992-02-01           1541
2 1992-03-01           1597
3 1992-04-01           1675
4 1992-05-01           1822

In [42]:
sales=pd.read_csv('./RetailSales_BeerWineLiquor.csv',parse_dates=[0])

In [44]:
sales

          DATE  MRTSSM4453USN
0   1992-01-01           1509
1   1992-02-01           1541
2   1992-03-01           1597
3   1992-04-01           1675
4   1992-05-01           1822
..         ...            ...
335 2019-12-01           6630
336 2020-01-01           4388
337 2020-02-01           4533
338 2020-03-01           5562
339 2020-04-01           5207

[340 rows x 2 columns]

In [51]:
sales=sales.set_index('DATE')

In [52]:
sales.resample(rule='A').mean()

            MRTSSM4453USN
DATE
1992-12-31    1807.250000
1993-12-31    1794.833333
1994-12-31    1841.750000
1995-12-31    1833.916667
1996-12-31    1929.750000
1997-12-31    2006.750000
1998-12-31    2115.166667
1999-12-31    2206.333333
2000-12-31    2375.583333
2001-12-31    2468.416667
2002-12-31    2491.166667
2003-12-31    2539.083333
2004-12-31    2682.416667
2005-12-31    2797.250000
2006-12-31    3001.333333
2007-12-31    3177.333333
2008-12-31    3292.000000
2009-12-31    3353.750000
2010-12-31    3450.083333
2011-12-31    3532.666667
2012-12-31    3697.083333
2013-12-31    3839.666667
2014-12-31    4023.833333
2015-12-31    4212.500000
2016-12-31    4434.416667
2017-12-31    4602.666667
2018-12-31    4830.666667
2019-12-31    4972.750000
2020-12-31    4922.500000